Revit 2027 API
Marble.MarbleSize Property
 The property labeled "Vein Spacing" from the "Marble" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MarbleSize { get; }
Public Shared ReadOnly Property MarbleSize As String
	Get
public:
static property String^ MarbleSize {
	String^ get ();
}
static member MarbleSize : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 100".
See Also
Reference
Marble Class
Autodesk.Revit.DB.Visual Namespace